<font color='green'>

### 17. Dış Kaynaklı Veri Okuma

### İnternetten aldığımız verileri okumaya çalışacağız. Veride 3 dosya olması lazım. Bunlar :
### .txt .csv .xlsx  türündedir. Amaç bu 3 veriyi python'a okutmak.

In [1]:
import pandas as pd

### [Bu sekmeden](https://github.com/mvahit/reading_data) data'yı zip olarak indiriyoruz.

### Sonrasında indirdiğimiz yeri bulup dosyaları zip'ten çıkartıyoruz. Github'tan indirdiysek readme.md dosyası da klasörün içinde olabilir ancak biz bu dosyayı okutmayacağımız için bu dosyayı direkt silebiliriz. Bize yukarıda bahsettiğim 3 dosya lazım.

### Yavaş yavaş indirdiğimiz dosyaları okumaya geçelim :

### Öncelikle zip olarak indirdiğimiz klasörü dışarı aynen çıkartalım ve çalıştığımız klasörün içine atalım.

### .txt ve .csv formunu aynı fonksiyon ile okuyabiliyoruz.

## 1) .csv okuma :

In [5]:
pd.read_csv("reading_data-master/ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

### Görüldüğü üzere noktalı virgül ile satır ayrımları yapılmış. Bunu python'ın anlayacağı şekle çevirmek için :

In [6]:
pd.read_csv("reading_data-master/ornekcsv.csv", sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

> **Şimdi daha güzel bir rablo oluşturmuş olduk.**

### ilk argüman okunmak istenen dosyanın konumunu, ikinci argüman ise verinin okunmasını düzgün bir şekle getirmek için kullanılır. ikinci argümanı kullanmadığımız zaman veriyi okumuş olsak da anlayabileceğimiz bir tablo ortaya çıkmamış olur. Noktalı virgül .csv için bir ayrım operatörüdür. Bunun sebebi ise .csv dosyaları genellikle excel'den oluşma veriler olduğu içindir.

## 2) .txt okuma :

In [7]:
pd.read_csv("reading_data-master/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

### Okuma işlemi başarılı bir şekilde gerçekleşti. Ancak tablo hala istediğimiz düzende değil. Bunun sebebi ise .txt dosyasının ayırma operatörü olarak boşluk bırakılmış olmasıdır.

## 3) .xlsx okuma :

In [8]:
pd.read_excel("reading_data-master/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

### Sorunsuz bir şekilde okundu.

In [10]:
dataf= pd.read_excel("reading_data-master/ornekx.xlsx")
type(dataf)

pandas.core.frame.DataFrame

### Görüldüğü üzere dataframe tipinde olduğu için şimdiye kadar gördüğümüz tüm fonksiyonları kullanabiliriz.

### Peki excel'deki ilk satırı görmezden gelmek için ne yapabiliriz?

In [12]:
pd.read_excel("reading_data-master/ornekx.xlsx", skiprows=1)

     78   12    1
0    78   12   2.0
1    78  324   3.0
2     7    2   4.0
3    88   23   5.0
4     6    2   NaN
5    56   11   6.0
6     7   12   7.0
7    56   21   7.0
8   346    2   8.0
9     5    1   8.0
10  456   21   8.0
11    3   12  88.0

### 1 değeri excel'deki ilk satırı temsil ettiği için ilk satırı okumadan geçtik.

In [14]:
pd.read_excel("reading_data-master/ornekx.xlsx", nrows=3)

    a    b  c
0  78   12  1
1  78   12  2
2  78  324  3

### .head() mantığı ile aynıdır. Baştan kaç satırı görmek istersek kullanırız. Açılımı da  *'number of rows'* tur.

In [15]:
pd.read_excel("reading_data-master/ornekx.xlsx", na_values=["300","500"])

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

### Örneğin bir değişkene yaş bilgisi atadığımızda kullanıcıların değere yanlışlıkla 300 ve 500 değerleri yazdığını gördük. Bunu NaN şeklinde değiştirmek için bu fonksiyon kullanılır. Ya da mesela yaş değerine eksi bir değer girilmemesi gerektiği halde girildi ise bu metodu kullanarak data setimizi karışık halinden biraz da olsa kurtarabiliriz.

### [18. .csv ve .excel Dosyalarına Veri Yazma notlarına geçmek için tıklayınız.](https://github.com/semihstp/Veri-Bilimi-Not-Defterim/blob/master/Pandas%20K%C3%BCt%C3%BCphanesi/18.%20.csv%20ve%20.excel%20Dosyalar%C4%B1na%20Veri%20Yazma.ipynb)